Repository: honzavalusek/pv239-project
Catalog: MalyFarmar/MalyFarmar/Resources/Strings/CreateUserPageStrings.*.resx
Languages: cs

# FirstNameLabel
source: First Name*
cs: Jméno*

# LastNameLabel
source: Last Name*
cs: Příjmení*

# PhoneNumberLabel
source: Phone Number*
cs: Telefonní číslo*

# DeviceLocationLabel
source: Device Location (Optional):
cs: Poloha zařízení (volitelné):

# GetCurrentLocationButtonText
source: Get Current Location
cs: Získat aktuální polohu

# CreateAccountButtonText
source: Create Account
cs: Vytvořit účet

# PageTitle
source: Create New Account
cs: Vytvořit nový účet

# EmailPlaceholder
source: e.g., john.doe@gmail.com
cs: např.: jan.novak@seznam.cz

# FirstNamePlaceholder
source: e.g., Doe
cs: např.: Jan

# LastNamePlaceholder
source: e.g., John
cs: např.: Novák

# PhoneNumberPlaceholder
source: e.g., +420123456789
cs: např.: +420123456789

# EmailRequiredMessage
source: Email is required.
cs: Email je povinný.

# FirstNameRequiredMessage
source: First name is required.
cs: Jméno je povinné.

# LastNameRequiredMessage
source: Last name is required.
cs: Příjmení je povinné.

# PhoneNumberRequiredMessage
source: Phone number is required.
cs: Telefonní číslo je povinné.

# InvalidEmailMessage
source: Please enter a valid email address.
cs: Prosím zadejte validní emailovou adresu.

# CorrectTheHighlightedFieldsMessage
source: Please correct the highlighted fields.
cs: Prosím opravte vyznačená pole.

# AccountCreatedAlertDescription
source: Account created successfully!
cs: Účet úspěšně vytvořen!

# FailedToCreateAccountMessage
source: Failed to create account. Unexpected response from server.
cs: Účet se nepodařilo vytvořit. Neočekávána odpověď od serveru.
