Repository: honzavalusek/pv239-project
Catalog: MalyFarmar/MalyFarmar/Resources/Strings/CreateProductPageStrings.*.resx
Languages: cs

# PageTitle
source: Add New Product
cs: Přidání produktu

# LabelProductName
source: Product Name*
cs: Název produktu*

# PlaceholderProductName
source: e.g., Fresh Apples
cs: např. "Čerstvá jablka"

# LabelDescription
source: Description
cs: Popis

# PlaceholderDescription
source: Detailed description of your product
cs: Detailní popis produktu

# LabelTotalAmount
source: Total Amount*
cs: Celkové množství*

# PlaceholderTotalAmount
source: e.g., 50.5
cs: např. 50.5

# LabelUnit
source: Unit*
cs: Jednotka*

# PlaceholderUnit
source: e.g., kg, piece, liter, bunch
cs: např. kg, kus, litr, tucet

# LabelPricePerUnit
source: Price Per Unit*
cs: Cena za jednotku*

# PlaceholderPricePerUnit
source: e.g., 2.99
cs: např. 2.99

# LabelProductImage
source: Product Image (Optional)
cs: Obrázek produktu (nepovinný)

# ButtonSelectImage
source: Select Image
cs: Přidat obrázek

# LabelSelectImage
source: Select Product Image
cs: Zvolte obrázek produktu

# ButtonAddProduct
source: Add Product
cs: Přidat produkt

# ErrorPickingImagePrefix
source: Error picking image
cs: Chyba při výběru obrázku

# ErrorProcessingImagePrefix
source: Error processing image file
cs: Chyba při zpracování obrázku

# ErrorCurrentUser
source: Could not determine current user. Please log in.
cs: Přihlášený uživatel nebyl rozpoznán. Přihlaste se znovu, prosím.

# AlertCreateSuccessTitle
source: Success
cs: Úspěch

# AlertCreateSuccessMessageFormat
source: Product '{0}' created!
cs: Produkt '{0}' úspěšně přidán!

# ErrorCreateFailedUnexpectedResponse
source: Failed to create product. Server returned an unexpected response.
cs: Chyba při vytváření obrázku. Server vrátil nečekanou chybu.

# ErrorCreateFailedPrefix
source: Creation failed
cs: Vytváření selhalo

# ValidationNameRequired
source: Product name is required.
cs: Název produktu je povinný.

# ValidationUnitRequired
source: Unit is required (e.g., kg, piece, liter).
cs: Jednotka je povinná (např. kg, kus, litr).

# ValidationTotalAmountInvalid
source: Valid total amount is required (must be > 0).
cs: Celkové množství musí být nezáporné číslo.

# ValidationPricePerUnitInvalid
source: Valid price per unit is required (must be > 0).
cs: Cena za jednotku musí být nezáporné číslo.

# ErrorUnexpectedPrefix
source: An unexpected error occurred
cs: Vyskytla se neočekávaná chyba.
