Repository: honzavalusek/pv239-project
Catalog: MalyFarmar/MalyFarmar/Resources/Strings/MyReservationsPageStrings.*.resx
Languages: cs

# PageTitle
source: My Reservations
cs: Moje rezervace

# LabelReservationId
source: Reservation ID:
cs: Číslo rezervace:

# LabelPickUpAt
source: Pick-up At:
cs: Datum vyzvednutí:

# LabelStatus
source: Status:
cs: Stav:

# LabelTotalPrice
source: Total Price:
cs: Celková cena:

# LabelCreatedAt
source: Created:
cs: Vytvořeno:

# LabelNotSet
source: Not set
cs: Nenastaveno

# StatusCurrentUserError
source: Could not identify current user. Please log in again.
cs: Nepodařilo se identifikovat uživatele. Prosím, přihlaste se znovu.

# StatusNoReservations
source: You have no reservations for your products yet.
cs: Zatím nejsou vytvořeny žádné rezervace na vaše produkty.

# StatusNoReservationsFoundOrError
source: No reservations found or an error occurred while loading.
cs: Nebyly nalezeny rezervace.

# StatusFailedToLoadPrefix
source: Failed to load reservations
cs: Chyba při načítání rezervací.

# StatusUnexpectedErrorPrefix
source: An unexpected error occurred
cs: Nastala neočekávaná chyba.

# StatusLoadingCancelled
source: Reservation loading cancelled.
cs: Načítání rezervací bylo přerušeno.

# OrderStatusCreated
source: New Order
cs: Nová objednávka

# OrderStatusPickUpSet
source: Pickup Date Set
cs: Domluvené vyzvednutí

# OrderStatusCompleted
source: Completed
cs: Dokončeno

# OrderStatusUnknown
source: Unknown Status
cs: Neznámý status
