Repository: honzavalusek/pv239-project
Catalog: MalyFarmar/MalyFarmar/Resources/Strings/OrderDetailPageStrings.*.resx
Languages: cs

# PageTitle
source: Reservation Details
cs: Detaily rezervace

# LabelOrderId
source: Order ID:
cs: Číslo rezervace:

# LabelStatus
source: Status:
cs: Stav:

# LabelTotalPrice
source: Total Price:
cs: Celková cena:

# LabelCreatedAt
source: Created:
cs: Vytvořeno:

# LabelPickUpAt
source: Pick-up At:
cs: Čas vyzvednutí:

# LabelPickUpDate
source: Pick-up Date:
cs: Datum vyzvednutí:

# LabelPickUpTime
source: Pick-up Time:
cs: Čas vyzvednutí:

# LabelBuyerInfo
source: Buyer Information
cs: Informace o zájemci

# LabelItems
source: Items
cs: Položky

# LabelProductName
source: Product:
cs: Produkt:

# LabelAmount
source: Amount:
cs: Množství:

# LabelPrice
source: Price:
cs: Cena:

# LabelSubtotal
source: Subtotal:
cs: Součet:

# ButtonSetPickUp
source: Set Pick-up Time
cs: Nastavit čas vyzvednutí

# ButtonCompleteOrder
source: Mark as Completed
cs: Označit jako dokončenou

# ErrorOrderNotFound
source: Order details not found.
cs: Detaily objednávky se nepodařilo najít.

# ErrorFailedToLoadDetailsPrefix
source: Failed to load order details
cs: Detaily objednávky se nepodařilo načíst.

# ErrorPickUpTimeInPast
source: Pick-up date and time must be in the future.
cs: Datum vyzvednutí musí být v budoucnosti.

# ErrorSettingPickUpTimePrefix
source: Error setting pick-up time
cs: Chyba při nastavení času vyzvednutí.

# ErrorCompletingOrderPrefix
source: Error completing order
cs: Chyba při ukončení objednávky

# AlertPickUpSetSuccess
source: Pick-up date and time have been set successfully!
cs: Čas vyzvednutí byl úspěšně nastaven!

# AlertOrderCompletedSuccess
source: Order marked as completed successfully!
cs: Objednávka byla úspěšně ukončena!

# ValueNotSet
source: Not set
cs: Nenastaveno

# AlertFinishConfirmTitle
source: Finish Order
cs: Dokončení objednávky

# AlertFinishConfirmMessage
source: Do you really want to finish this order? This action is irreversible.
cs: Doopravdy chcete tuto objednávku dokončit? Tato akce je nevratná.

# AlertFinishConfirmYes
source: Yes, finish
cs: Ano, dokončit

# AlertFinishConfirmCancel
source: Back
cs: Storno
