Repository: honzavalusek/pv239-project
Catalog: MalyFarmar/MalyFarmar/Resources/Strings/SellPageStrings.*.resx
Languages: cs

# SellPageTitle
source: My Products
cs: Moje Produkty

# AddProductToolbarItemText
source: Add Product
cs: Přidej Produkt

# ProductItemPriceLabel
source: Price:
cs: Cena:

# ProductItemAvailableLabel
source: Available:
cs: Dostupné:

# StatusCurrentUserError
source: Could not identify current user. Please log in again.
cs: Přihlášený uživatel nebyl rozpoznán. Přihlaste se znovu, prosím.

# StatusNoProductsSelling
source: You are not currently selling any products.
cs: Zatím nenabízíte žádné produkty.

# StatusNoProductsFoundOrError
source: No products found or an error occurred while loading.
cs: Žádné produkty nebyly nalezeny.

# StatusFailedToLoadProductsPrefix
source: Failed to load your products
cs: Nastala chyba při načítání Vašich produktů.

# StatusUnexpectedErrorPrefix
source: An unexpected error occurred
cs: Nastala neočekávaná chyba.

# StatusLoadingCancelled
source: Product loading cancelled.
cs: Načítání produktů bylo přerušeno.
